#### LineProperties Members

---

|  |
| --- |
| LineProperties Class   Methods   Properties   See Also |

The  LineProperties  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  LineProperties |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Color | The current color used when drawing lines/curves. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LineWidth | The current width (thickness) of the pen stroke when drawing lines/curves. |
| Public property | PatternId | Id of the current Line pattern element used when drawing lines/curves. |
| Public property | Transparency | The current transparency level to be applied to the current color. |

# See Also

LineProperties Class

Autodesk.Revit.DB Namespace